Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 embedding_1 (Embedding)     (None, 200, 128)          1280000
 gru (GRU)                   (None, 128)               99072
 dense_1 (Dense)             (None, 1)                 129
=================================================================
Total params: 1379201
